vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN946_DFP.pdsc
    <condition id="driver.gt911.condition_id">
      <require condition="allOf.device=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.i3c.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.i3c_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.i3c, device=MCXN946.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.i3c, device=MCXN946.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require condition="device.MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.inputmux.condition_id">
      <require condition="allOf.driver.common, driver.inputmux_connections, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.inputmux_connections, device_id=MCXN946.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
      <require condition="device_id.MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.inputmux_connections.condition_id">
      <require condition="allOf.device=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.intm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.irtc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.itrc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.lpadc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.lpc_freqme.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.lpcmp.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpi2c.condition_id">
      <require condition="allOf.driver.lpflexcomm, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm, device_id=MCXN946.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpflexcomm"/>
      <require condition="device_id.MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpi2c_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.lpflexcomm_lpi2c, device=MCXN946.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.lpflexcomm_lpi2c, device=MCXN946.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c"/>
      <require condition="device.MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpspi.condition_id">
      <require condition="allOf.driver.lpflexcomm, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpspi_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.lpflexcomm_lpspi, device=MCXN946.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.lpflexcomm_lpspi, device=MCXN946.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpuart.condition_id">
      <require condition="allOf.driver.lpflexcomm, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpuart_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.lpflexcomm_lpuart, device=MCXN946.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.lpflexcomm_lpuart, device=MCXN946.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.lptmr.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.mailbox.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN946.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN946.internal_condition"/>
    </condition>
